alejandro-cp95/Bootloader/Bootloader_STM32F334/Src/main.c
	// Extract the CRC32 sent by the Host
	uint32_t host_crc = *((uint32_t*) (bl_rx_buffer+command_packet_len-4));

	if(!bootloader_verify_crc(&bl_rx_buffer[0],command_packet_len-4,host_crc))
	{
		printmsg("BL_DEBUG_MSG: Checksum success!\n\r");
		// Checksum is correct
		bootloader_send_ack(1);
		bl_version=get_bootloader_version();
		printmsg("BL_DEBUG_MSG: BL_VER: %d %#x\n",bl_version,bl_version);
		bootloader_uart_write_data(&bl_version,1);
	}
	else
	{
		printmsg("BL_DEBUG_MSG: Checksum fail!\n\r");
		// Checksum is wrong. Send nack
		bootloader_send_nack();
	}
}

/* Bootloader sends out all supported command codes */
void bootloader_handle_gethelp_cmd(uint8_t* bl_rx_buffer)
{
	printmsg("BL_DEBUG_MSG: bootloader_handle_gethelp_cmd\n\r");

	// Total length of the command packet
	uint32_t command_packet_len=bl_rx_buffer[0]+1;

	// Extract the CRC32 sent by the Host
	uint32_t host_crc = *((uint32_t*) (bl_rx_buffer+command_packet_len-4));

	if(!bootloader_verify_crc(bl_rx_buffer,command_packet_len-4,host_crc))
	{
		printmsg("BL_DEBUG_MSG: Checksum success!\n\r");
		// Checksum is correct
		bootloader_send_ack(sizeof(supported_commands));
		bootloader_uart_write_data(supported_commands,sizeof(supported_commands));
	}
	else
	{
		printmsg("BL_DEBUG_MSG: Checksum fail!\n\r");
		// Checksum is wrong. Send nack
		bootloader_send_nack();
	}
}

/* Gets the chip identification number */
void bootloader_handle_getcid_cmd(uint8_t* bl_rx_buffer)
{
	uint16_t bl_cid_number=0;
	printmsg("BL_DEBUG_MSG: bootloader_handle_getcid_cmd\n\r");

	// Total length of the command packet
	uint32_t command_packet_len=bl_rx_buffer[0]+1;

	// Extract the CRC32 sent by the Host
	uint32_t host_crc = *((uint32_t*) (bl_rx_buffer+command_packet_len-4));

	if(!bootloader_verify_crc(bl_rx_buffer,command_packet_len-4,host_crc))
	{
		printmsg("BL_DEBUG_MSG: Checksum success!\n\r");
		// Checksum is correct
		bootloader_send_ack(2);
		bl_cid_number=get_mcu_chip_id();
		printmsg("BL_DEBUG_MSG: MCU id: %d %#x!\r\n",bl_cid_number,bl_cid_number);
		bootloader_uart_write_data((uint8_t*)&bl_cid_number,2);
	}
	else
	{
		printmsg("BL_DEBUG_MSG: Checksum fail!\n\r");
		// Checksum is wrong. Send nack
		bootloader_send_nack();
	}
}

/* Gets the read protection status */
void bootloader_handle_getrdp_cmd(uint8_t* bl_rx_buffer)
{
	uint8_t rdp_level=0;
	printmsg("BL_DEBUG_MSG: bootloader_handle_getrdp_cmd\n\r");

	// Total length of the command packet
	uint32_t command_packet_len=bl_rx_buffer[0]+1;

	// Extract the CRC32 sent by the Host
	uint32_t host_crc = *((uint32_t*) (bl_rx_buffer+command_packet_len-4));

	if(!bootloader_verify_crc(bl_rx_buffer,command_packet_len-4,host_crc))
	{
		printmsg("BL_DEBUG_MSG: Checksum success!\n\r");
		// Checksum is correct
		bootloader_send_ack(1);
		rdp_level=get_flash_rdp_level();
		printmsg("BL_DEBUG_MSG: RDP level: %d %#x!\r\n",rdp_level,rdp_level);
		bootloader_uart_write_data(&rdp_level,1);
	}
	else
	{
		printmsg("BL_DEBUG_MSG: Checksum fail!\n\r");
		// Checksum is wrong. Send nack
		bootloader_send_nack();
	}
}

/* Goes to the direction we specify */
void bootloader_handle_go_cmd(uint8_t* bl_rx_buffer)
{
	uint32_t go_address=0;
	uint8_t addr_valid=ADDR_VALID;
	uint8_t addr_invalid=ADDR_INVALID;

	printmsg("BL_DEBUG_MSG: bootloader_handle_go_cmd\n\r");

	// Total length of the command packet
	uint32_t command_packet_len=bl_rx_buffer[0]+1;

	// Extract the CRC32 sent by the Host
	uint32_t host_crc = *((uint32_t*) (bl_rx_buffer+command_packet_len-4));

	if(!bootloader_verify_crc(bl_rx_buffer,command_packet_len-4,host_crc))
	{
		printmsg("BL_DEBUG_MSG: Checksum success!\n\r");
		// Checksum is correct
		bootloader_send_ack(1);
		/* Extract the go address */
		go_address = *((uint32_t*)&bl_rx_buffer[2]);
		printmsg("BL_DEBUG_MSG: GO addr: %#x!\r\n",go_address);
		if(verify_address(go_address)==ADDR_VALID)
		{
			/* Tell the host that address is fine */
			bootloader_uart_write_data(&addr_valid,1);

			/* Jump to "go" address.
			 * we don't care what is being done ther.
			 * Host must ensure that valid code is present over there.
			 * It's not th
			 * e duty of bootloader. So just trust and jump */

			/* Not doing the below line will result in hardfault exception for ARM Cortex M */

			/* Since the Cortex-M processors don't support the ARM instruction set,
			 * but only Thumb instruction set the T bit must always be 1, which
			 * is linked to the 0th bit of the PC */
			go_address+=1; /* Make T bit = 1 */
			void(*lets_jump)(void)=(void*)go_address;
			printmsg("BL_DEBUG_MSG: Jumping to go address!\r\n");
			HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin,0);
			lets_jump();
		}
		else
		{
            printmsg("BL_DEBUG_MSG: GO addr invalid ! \n");
            //tell host that address is invalid
            bootloader_uart_write_data(&addr_invalid,1);
		}
	}
	else
	{
		printmsg("BL_DEBUG_MSG: Checksum fail!\n\r");
		// Checksum is wrong. Send nack
		bootloader_send_nack();
	}
}

/* Erases a specified portion of the Flash memory */
void bootloader_handle_flash_erase_cmd(uint8_t* bl_rx_buffer)
{
	uint8_t erase_status=0x00;
	printmsg("BL_DEBUG_MSG: bootloader_handle_flash_erase_cmd\n\r");

	// Total length of the command packet
	uint32_t command_packet_len=bl_rx_buffer[0]+1;

	// Extract the CRC32 sent by the Host
	uint32_t host_crc = *((uint32_t*) (bl_rx_buffer+command_packet_len-4));

	if(!bootloader_verify_crc(bl_rx_buffer,command_packet_len-4,host_crc))
	{
		printmsg("BL_DEBUG_MSG: Checksum success!\n\r");
		// Checksum is correct
		bootloader_send_ack(1);
		printmsg("BL_DEBUG_MSG: Initial page: %d no_of_pages: %d\n\r",bl_rx_buffer[2],bl_rx_buffer[3]);

		HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin,0);
		erase_status = execute_flash_erase(bl_rx_buffer[2],bl_rx_buffer[3]);
		HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin,1);

		bootloader_uart_write_data(&erase_status,1);
		printmsg("BL_DEBUG_MSG: Flash erase status: %#x\r\n",erase_status);
	}
	else
	{
		printmsg("BL_DEBUG_MSG: Checksum fail!\n\r");
		// Checksum is wrong. Send nack
		bootloader_send_nack();
	}
}

/* Writes a specified portion of the Flash memory */
void bootloader_handle_mem_write_cmd(uint8_t* bl_rx_buffer)
{
	uint8_t write_status=0x00;
	uint8_t payload_len=bl_rx_buffer[6];

	uint32_t mem_address=*((uint32_t*)(&bl_rx_buffer[2]));

