alejandro-cp95/Bootloader/Bootloader_STM32F334/Src/main.c
	printmsg("BL_DEBUG_MSG: bootloader_handle_mem_write_cmd\n\r");

	// Total length of the command packet
	uint32_t command_packet_len=bl_rx_buffer[0]+1;

	// Extract the CRC32 sent by the Host
	uint32_t host_crc = *((uint32_t*) (bl_rx_buffer+command_packet_len-4));

	if(!bootloader_verify_crc(bl_rx_buffer,command_packet_len-4,host_crc))
	{
		printmsg("BL_DEBUG_MSG: Checksum success!\n\r");
		// Checksum is correct
		bootloader_send_ack(1);
		printmsg("BL_DEBUG_MSG: Mem write address: %#x\n\r",mem_address);
		if(verify_address(mem_address)==ADDR_VALID)
		{
			printmsg("BL_DEBUG_MSG: Valid mem write address\n\r");
			HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin,0);
			write_status = execute_mem_write((uint16_t*)&bl_rx_buffer[7],mem_address,payload_len);
			HAL_GPIO_WritePin(LD2_GPIO_Port,LD2_Pin,1);
			bootloader_uart_write_data(&write_status,1);
		}
		else
		{
			printmsg("BL_DEBUG_MSG: Invalid mem write address\n\r");
			write_status=ADDR_INVALID;
			/* Inform host that address is invalid */
			bootloader_uart_write_data(&write_status,1);
		}
	}
	else
	{
		printmsg("BL_DEBUG_MSG: Invalid mem write address\n\r");
		// Checksum is wrong. Send nack
		bootloader_send_nack();
	}
}

void bootloader_handle_en_r_w_protect(uint8_t* bl_rx_buffer)
{

}

void bootloader_handle_mem_read(uint8_t* bl_rx_buffer)
{

}

void bootloader_handle_read_page_prot_status(uint8_t* bl_rx_buffer)
{

}

void bootloader_handle_read_otp(uint8_t* bl_rx_buffer)
{

}

void bootloader_handle_dis_r_w_protect(uint8_t* bl_rx_buffer)
{

}

/* This function sends ACK if CRC matches along with "length to follow" */
void bootloader_send_ack(uint8_t follow_len)
{
	// Here we send 2 bytes. The first one is ACK, and the second one is the length value
	uint8_t ack_buf[2];
	ack_buf[0]=BL_ACK;
	ack_buf[1]=follow_len;
	HAL_UART_Transmit(C_UART,ack_buf,2,HAL_MAX_DELAY);
}

void bootloader_send_nack(void)
{
	uint8_t nack=BL_NACK;
	HAL_UART_Transmit(C_UART,&nack,1,HAL_MAX_DELAY);
}

/* This verifies the CRC of the given buffer in pData */
uint8_t bootloader_verify_crc(uint8_t* pData,uint32_t len, uint32_t crc_host)
{
	uint32_t uwCRCValue=0xFF;
	/* Reset CRC Calculation Unit */
	__HAL_CRC_DR_RESET(&hcrc);
	for(uint32_t i=0; i<len; i++)
	{
		uint32_t i_data=pData[i];
		uwCRCValue=HAL_CRC_Accumulate(&hcrc,&i_data,1);
	}
	if(uwCRCValue==crc_host)
	{
		return VERIFY_CRC_SUCCESS;
	}
	return VERIFY_CRC_FAIL;
}

/* This function writes data in to C_UART */
void bootloader_uart_write_data(uint8_t* pBuffer, uint32_t len)
{
	/* You can replace the below ST's USART driver API call with your MCU's driver API call */
	HAL_UART_Transmit(C_UART,pBuffer,len,HAL_MAX_DELAY);
}

/* Just returns the macro value */
uint8_t get_bootloader_version(void)
{
	return (uint8_t)BL_VERSION;
}

/* Read the chip identifier or device identifier */
uint16_t get_mcu_chip_id(void)
{
	/* The STM32F334XX MCUs integrate an MCU ID code. This ID identifies the ST MCU part number
	 * and the die revision. It is part of the DBG_MCU component and is mapped on the
	 * external PPB bus (see Section 31.15 on page 1111). This code is accessible using the
	 * JTAG debug port (4 to 5 pins) or the SW debug port (two pins) or by the user software
	 * It is even accessible while the MCU is under system reset. */
	uint16_t cid;
	cid=(uint16_t)(DBGMCU->IDCODE)&0x0FFF;
	return cid;
}

/* Returns the read protection status */
uint8_t get_flash_rdp_level(void)
{
	uint8_t rdp_status=0;
#if 0
	FLASH_OBProgramInitTypeDef ob_handle;
	HAL_FLASHEx_OBGetConfig(&ob_handle);
	rdp_status=(uint8_t)ob_handle.RDPLevel;
#else
	volatile uint32_t* pOB_addr=(uint32_t*) 0x1FFFF800;
	rdp_status=(uint8_t)(*pOB_addr);
#endif
	return rdp_status;
}

/* Verify the address sent by the host */
uint8_t verify_address(uint32_t go_address)
{
	/* What are the valid addresses to which we can jump?
	 * Can we jump to system memory? Yes
	 * Can we jump to SRAM1 memory? Yes
	 * Can we jump to Backup registers? Yes
	 * Can we jump to peripheral memory? It's possible, but not allowed, so no
	 * Can we jump to external memory? Yes */

	/* Incomplete -poorly written.. optimize it */
	if(go_address>= SRAM_BASE&&go_address<=SRAM_END)
	{
		return ADDR_VALID;
	}
	else if(go_address>= FLASH_BASE&&go_address<=FLASH_END)
	{
		return ADDR_VALID;
	}
	else if(go_address>= SYSTEM_MEMORY_BASE&&go_address<=SYSTEM_MEMORY_END)
	{
		return ADDR_VALID;
	}
	else
	{
		return ADDR_INVALID;
	}
}

uint8_t execute_flash_erase(uint8_t page_number, uint8_t number_of_pages)
{
	/* We have totally 32 pages (0 to 31) in STM32F334 MCU
	 * number_of_pages has to be in the range of 0 to 31
	 * If page_number=0xFF, that means mass erase!
	 * Code needs to be modified if your MCU supports more flash pages/sectors */
	FLASH_EraseInitTypeDef flashErase_handle;
	uint32_t pageError;
	HAL_StatusTypeDef status;

	if(number_of_pages>32)
	{
		return INVALID_PAGE;
	}
	if((page_number==0xFF)||(page_number<=31))
	{
		if(page_number==(uint8_t)0xFF)
		{
			flashErase_handle.TypeErase=FLASH_TYPEERASE_MASSERASE;
		}
		else
		{
			/* Here we are just calculating how many pages need to be erased */
			uint8_t remaining_pages = 32-page_number;
			if(number_of_pages>remaining_pages)
			{
				number_of_pages=remaining_pages;
			}
			flashErase_handle.TypeErase=FLASH_TYPEERASE_PAGES;
			flashErase_handle.PageAddress=(FLASH_BASE+2*1024*page_number);
			flashErase_handle.NbPages=number_of_pages;
		}
		/* Get access to touch the flash registers */
		HAL_FLASH_Unlock();
		status=(uint8_t)HAL_FLASHEx_Erase(&flashErase_handle,&pageError);
		HAL_FLASH_Lock();
		return status;
	}
	return INVALID_PAGE;
}

/* This function writes the contents of pBuffer to "mem_address" byte by byte */
/* Note1: Currently this function supports writeing to Flash only */
/* Note2_ This functions don't check whether "mem_address" is a valid address of the Flash range */
uint8_t execute_mem_write(uint16_t* pBuffer, uint32_t mem_address, uint8_t len)
{
	uint8_t status=HAL_OK;
	/* We have to unlock flash module to get control of registers */
	HAL_FLASH_Unlock();
	for(uint8_t i=0;i<len;i+=2)
	{
		/* Here we program the flash byte by byte */
		status=HAL_FLASH_Program(FLASH_TYPEPROGRAM_HALFWORD,mem_address+i,pBuffer[i/2]);
	}
	HAL_FLASH_Lock();
	return status;
}

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
